lang/c/pointers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-27 Sat 01:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fun with Pointers</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shubham Mahajan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="http://spacemacs.org/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Fun with Pointers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org59c7191">1. <span class="todo TODO">TODO</span> Basics of pointers</a>
<ul>
<li><a href="#orge88ab7b">1.1. <span class="done DONE">DONE</span> Definition</a></li>
<li><a href="#orgedb3a30">1.2. Syntax</a></li>
<li><a href="#orgd45ab16">1.3. What’s the data-type of a pointer?</a></li>
<li><a href="#org033d51d">1.4. <b>Why do we specify data-type before the pointer’s name if it’s of <code>unsigned long int</code> type?</b></a></li>
</ul>
</li>
<li><a href="#orgaa2458e">2. Thank You!</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100% class=&quot;center&quot;">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Home</td>
<td class="org-left">Featured Blogs</td>
<td class="org-left"><a href="https://github.com/imahajanshubham">GitHub</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org59c7191" class="outline-2">
<h2 id="org59c7191"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Basics of pointers</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge88ab7b" class="outline-3">
<h3 id="orge88ab7b"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Definition</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A pointer is a variable which stores the address (memory location) of another variable.
</p>
</div>
</div>

<div id="outline-container-orgedb3a30" class="outline-3">
<h3 id="orgedb3a30"><span class="section-number-3">1.2</span> Syntax</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In C Language, The syntax of declaring a pointer is as follows:
</p>

<div class="org-src-container">
<pre class="src src-C">&lt;data-type&gt; *ptr_name; 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd45ab16" class="outline-3">
<h3 id="orgd45ab16"><span class="section-number-3">1.3</span> What’s the data-type of a pointer?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
_The data-type of any pointer is always an_#a100ff <code>unsigned long int</code> i.e a pointer always stores
the address of another variable and the address is in hex form.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdlib.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">ptr</span> = <span style="color: #a45bad;">NULL</span>;

  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Size of &#8217;unsigned long&#8217;: %lu"</span>, <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">unsigned</span> <span style="color: #ce537a; font-weight: bold;">long</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Size of &#8217;ptr&#8217;: %lu\n\n"</span>, <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>ptr<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">return</span> EXIT_SUCCESS;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Output
</p>

<pre class="example">
Size of ’unsigned long’: 8
Size of ’ptr’: 8

</pre>

<div class="note">
<p>
The <code>sizeof</code> operator always returns an <code>unsigned long int</code> value (address), so we
use <code>%lu</code> format specifier for the same.
</p>

</div>
</div>
</div>

<div id="outline-container-org033d51d" class="outline-3">
<h3 id="org033d51d"><span class="section-number-3">1.4</span> <b>Why do we specify data-type before the pointer’s name if it’s of <code>unsigned long int</code> type?</b></h3>
<div class="outline-text-3" id="text-1-4">
<p>
To specify the data–type of the variable, whose address pointer is going to
store.
</p>

<ul class="org-ul">
<li>Who does a pointer need to know about the data-type of the variable whose
value it’s going to store?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaa2458e" class="outline-2">
<h2 id="orgaa2458e"><span class="section-number-2">2</span> Thank You!</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shubham Mahajan</p>
<p class="date">Created: 2018-01-27 Sat 01:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>